In [3]:
# Importing packages
import psycopg2
import pandas as pd
import numpy as np
import math

In [4]:
#Method to connect to DB
def connectDB():
    #create a connection
    conn = psycopg2.connect(
    host="localhost",
    database="university",
    user="postgres",
    password="gremio")

    #create a cursor
    cur = conn.cursor()
    print("Connected")
    return conn, cur

In [5]:
#Selecting the data

def selectData(sql_select):
    #input = Query
    cur.execute(sql_select)
    data = cur.fetchall()

    #showing
    #x = input("Wanna print the data? Press 1 ==>> ____")
    #if x==1:
        #for line in data:
            #print(line)
    return data

In [6]:
#Select all Tables Names
def selectTables(t_schema):
    s = ""
    s += "SELECT"
    s += " table_schema"
    s += ", table_name"
    s += " FROM information_schema.tables"
    s += " WHERE"
    s += " ("
    s += " table_schema = 'public'"
    s += " )"
    s += " ORDER BY table_schema, table_name;"
    
    cur.execute(s)
    list_tables = cur.fetchall()


    return list_tables

In [7]:
conn, cur = connectDB()
selectTables('public')

Connected

[('public', 'course'),
 ('public', 'enrolled'),
 ('public', 'grades'),
 ('public', 'students')]

In [6]:
#closing cursor and connections
cur.close()
conn.close()

In [7]:
#Putting all tables into DF
conn, cur = connectDB()

tables = selectTables('public')
list_tables = []

for i,v in tables:
    #print(i)
    #print(v)
    list_tables.append(v) #put only table name, not schema name

Connected

In [8]:
list_tables

['bbc', 'eteam', 'game', 'goal', 'hans', 'movies', 'nobel', 'test', 'world']

In [9]:
#put all tables on a list of DataFrames
list_df = []
for i in range(0,len(list_tables)):
    conn, cur = connectDB()
    sql_query = "SELECT * from %s" %(list_tables[i])
    #print(sql_query)
    data = selectData(sql_query) #use the query to find data
    
    colnames = [desc[0] for desc in cur.description]
    df = pd.DataFrame(data, columns=colnames)
    list_df.append(df)
    cur.close()
    conn.close()

Connected
Connected
Connected
Connected
Connected
Connected
Connected
Connected
Connected

In [10]:
#showing columns of all DF imported
for i in range(0,len(list_df)):
    print(list_df[i].columns)

Index(['name', 'region', 'area', 'population', 'gdp'], dtype='object')
Index(['id', 'teamname', 'coach'], dtype='object')
Index(['id', 'mdate', 'stadium', 'team1', 'team2'], dtype='object')
Index(['matchid', 'teamid', 'player', 'gtime'], dtype='object')
Index(['name', 'continent', 'area', 'gdp', 'capital', 'tld', 'flag'], dtype='object')
Index(['color', 'director_name', 'num_critic_for_reviews', 'duration',
       'director_facebook_likes', 'actor_3_facebook_likes', 'actor_2_name',
       'actor_1_facebook_likes', 'gross', 'genres', 'actor_1_name',
       'movie_title', 'num_voted_users', 'cast_total_facebook_likes',
       'actor_3_name', 'facenumber_in_poster', 'plot_keywords',
       'movie_imdb_link', 'num_user_for_reviews', 'language', 'country',
       'content_rating', 'budget', 'title_year', 'actor_2_facebook_likes',
       'imdb_score', 'aspect_ratio', 'movie_facebook_likes'],
      dtype='object')
Index(['yr', 'subject', 'winner'], dtype='object')
Index(['name', 'id'], dtype='object')
Index(['name', 'continent', 'area', 'population', 'gdp', 'capital', 'tld',
       'flag'],
      dtype='object')

In [11]:
list_df[0] #picking first DF

                    name         region     area  population           gdp
0                Albania         Europe    28728   3200000.0  6.656000e+09
1                Algeria    Middle East  2400000  32900000.0  7.501200e+10
2                Andorra         Europe      468     64000.0           NaN
3                 Angola         Africa  1250000  14500000.0  1.493500e+10
4    Antigua and Barbuda       Americas      442     77000.0  7.700000e+08
..                   ...            ...      ...         ...           ...
187            Venezuela  South America   881050  26600000.0           NaN
188              Vietnam   Asia-Pacific   329247  83600000.0  4.598000e+10
189                Yemen    Middle East   536869  21500000.0  1.225500e+10
190               Zambia         Africa   752614  11000000.0  4.950000e+09
191             Zimbabwe         Africa   390759  12900000.0  6.192000e+09

[192 rows x 5 columns]

In [26]:
# Script to Manipulate DB
conn, cur = connectDB()

select = " SELECT * from public.hans"

query = """CREATE TABLE public.hans
                     (
                    name text,
                    continent text,
                    area float,
                    gdp float,
                    capital text,
                    tld text,
                    flag text

                );"""

alter_table = """ ALTER TABLE public.hans
                                    (
                                    ADD franke integer
                                    
                                    );


"""

insert_values = """ INSERT INTO public.hans (name, continent, area, gdp, capital, tld, flag)
                    VALUES ( 'Nathi', 'test', 20 , 30, 'Aracatuba', 'xx', 'great' )
                    
                """

conn, cur = connectDB() #connect with DB

cur.execute(insert_values)
cur.close()
conn.commit()
conn.close()

Connected
Connected

In [27]:
conn, cur = connectDB() #connect with DB

data = selectData(select)

cur.close()
conn.commit()
conn.close()
data

Connected

[('Nathi', 'test', 20.0, 30.0, 'Aracatuba', 'xx', 'great'),
 ('Nathi', 'test', 20.0, 30.0, 'Aracatuba', 'xx', 'great'),
 ('Nathi', 'test', 20.0, 30.0, 'Aracatuba', 'xx', 'great')]